stress-test/artillery/campaign-smoke.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Smoke test
  http:
    timeout: 15

scenarios:
  - name: Campaign list smoke
    flow:
      - get:
          url: "/api/campaigns?page=1&per_page=15"
          headers:
            Accept: "application/json"