stress-test/artillery/light.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Light load (5 VUs)
  http:
    timeout: 30
scenarios:
  - name: Read endpoints
    flow:
      - get:
          url: "/api/campaigns?page=1"
      - get:
          url: "/api/campaigns/status/aktif?page=1"
      - get:
          url: "/api/donations/stats"