stress-test/artillery/medium-campaign.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 120
      arrivalRate: 20
      name: Medium load (20 VUs)
  http:
    timeout: 600
scenarios:
  - name: Mixed read workload
    flow:
      - get:
          url: "/api/campaigns?page=1"
      - get:
          url: "/api/campaigns/status/aktif?page=1"
      - get:
          url: "/api/donation-categories"