stress-test/artillery/stress.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 50
      name: Stress (50 VUs)
    - duration: 60
      arrivalRate: 100
      name: Peak (100 VUs)
  http:
    timeout: 30
scenarios:
  - name: Read-heavy workload
    flow:
      - get:
          url: "/api/campaigns?page=1"