stress-test/artillery/write-heavy.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up writes
    - duration: 180
      arrivalRate: 20
      name: Sustained write load
    - duration: 120
      arrivalRate: 35
      name: Peak write load
  processor: "./processor.cjs"
  http:
    timeout: 20

scenarios:
  - name: Donation write load
    flow:
      - function: setDynamicDonationPayload
      - post:
          url: "/api/donations"
          headers:
            Accept: "application/json"
            Content-Type: "application/json"
            X-Idempotency-Key: "{{ idempotency_key }}"
          json:
            campaign_id: "{{ campaign_id }}"
            amount: "{{ amount }}"
            is_anonymous: "{{ is_anonymous }}"
            donor_name: "{{ donor_name }}"
            note: "stress-test"
      - get:
          url: "/api/campaigns/1/donations/total"